{"class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "activity_regularizer": null, "strides": [1, 1], "use_bias": true, "trainable": true, "kernel_regularizer": null, "kernel_constraint": null, "dtype": "float32", "bias_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_1", "data_format": "channels_last", "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "batch_input_shape": [null, 28, 28, 1], "padding": "valid"}}, {"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "activity_regularizer": null, "strides": [1, 1], "use_bias": true, "trainable": true, "kernel_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "dilation_rate": [1, 1], "bias_constraint": null, "name": "conv2d_2", "data_format": "channels_last", "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "filters": 64, "padding": "valid"}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "trainable": true, "pool_size": [2, 2]}}, {"class_name": "Dropout", "config": {"trainable": true, "seed": null, "rate": 0.25, "noise_shape": null, "name": "dropout_1"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "use_bias": true, "trainable": true, "kernel_regularizer": null, "bias_constraint": null, "units": 128, "name": "dense_1", "kernel_constraint": null, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}}}, {"class_name": "Dropout", "config": {"trainable": true, "seed": null, "rate": 0.5, "noise_shape": null, "name": "dropout_2"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "use_bias": true, "trainable": true, "kernel_regularizer": null, "bias_constraint": null, "units": 10, "name": "dense_2", "kernel_constraint": null, "activation": "softmax", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}}}], "keras_version": "2.0.9"}