{"backend": "tensorflow", "keras_version": "2.0.9", "class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"trainable": true, "dtype": "float32", "batch_input_shape": [null, 28, 28, 1], "bias_constraint": null, "kernel_size": [3, 3], "activity_regularizer": null, "padding": "valid", "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "filters": 32, "name": "conv2d_1", "bias_regularizer": null, "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"trainable": true, "bias_constraint": null, "padding": "valid", "activity_regularizer": null, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "kernel_regularizer": null, "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_size": [3, 3], "name": "conv2d_2", "bias_regularizer": null, "data_format": "channels_last"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "trainable": true, "strides": [2, 2], "name": "max_pooling2d_1", "padding": "valid", "data_format": "channels_last"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "rate": 0.25, "seed": null, "noise_shape": null}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"trainable": true, "bias_constraint": null, "activity_regularizer": null, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 128, "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "name": "dense_1", "bias_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "rate": 0.5, "seed": null, "noise_shape": null}}, {"class_name": "Dense", "config": {"trainable": true, "bias_constraint": null, "activity_regularizer": null, "activation": "softmax", "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 10, "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "name": "dense_2", "bias_regularizer": null}}]}